app/Controllers/Auth.php

    public function doLogin()
    {
        $session = session();
        $userModel = new UserModel();

        $email = trim($this->request->getPost('email'));
        $password = $this->request->getPost('password');

        // Validasi sederhana
        if (empty($email) || empty($password)) {
            $session->setFlashdata('error', 'Email dan password wajib diisi.');
            return redirect()->to('/login')->withInput();
        }

        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'guru@example.com'
 LIMIT 1